<?php

//$a = 3;
//$b = pow($a , 6);
//$c = $b % 5;
//
//if($c === 0 ){
//print_r($b / 5);
//}
//else {
//print_r($b." Не кратен 5");
//}


//$day = $argv[1];
//
//if ($day < 31 && $day > 0) {
//    if ($day > 1 && $day < 11) {
//        print_r('Первая декада');
//    } elseif ($day > 10 && $day < 21) {
//        print_r('Вторая декада');
//    } elseif ($day > 20 && $day <= 31) {
//        print_r('Третья декада');
//    }
//} else {
//    print_r('Некорректный ввод!');
//}


//***********************************
//привет Никита, две задачи выполнил по примерам которые разбирали на уроке
//третья задача я не понимаю как составить условие, не говоря о решении
//матерьял урока читал, запомнить этот объем для меня нереально, пока что это каша
//я от прагроммирования очень далек, мне 44 года, работаю ИП в строительстве, знаю что программа курса объемная и
//вероятно стану слушителем курса, т.к. скорее всего поплыву